// Почувствуй себя сеньором
// 31. Задать массив из 8 элементов и вывести их на экран 

// string value (int a){
//     string res = string.Empty;
//     int [] arr = new int [a];
//     for (int i = 0; i < arr.Length; i++) {arr [i] = new Random().Next(0, 2);}
//     for (int i = 0; i < arr.Length; i++) {res = $"{res} {arr[i]}";}
//     return res;
// }
// Console.Write(value(8));


// 32. Задать массив из 8 элементов, заполненных нулями и единицами вывести их на экран 

// 33. Задать массив из 12 элементов, заполненных числами из [0,9]. Найти сумму положительных/отрицательных элементов массива

// string value (int a)
// {
//     string res = string.Empty;
//     int [] arr = new int [a];
//     for (int i = 0; i < arr.Length; i++) {arr [i] = new Random().Next(0, 10);}
//     for (int i = 0; i < arr.Length; i++) {res = $"{res} {arr[i]}";}
//     return res;
// }
// int summa (int array)
// {
//     int summ = 0;
//     if (arr[i] > 0) summ = summ + arr[i];
// }

// 34. Написать программу замену элементов массива на противоположные
// 35. Определить, присутствует ли в заданном массиве, некоторое число 

// bool func35 (int N)
// {
//     string result = string.Empty;
//     int [] array = new int [8];
//     for (int i = 0; i < array.Length; i++) 
//     {
//         array[i] = new Random().Next(1, 6);
//     }
//     for (int i = 0; i < array.Length; i++)
//     {
//         result = $"{result} {array[i]}";
//     }
//     Console.WriteLine(result);
//     return (array[i]=N);
// }
// Console.WriteLine(func35(4));

// 36. Задать массив, заполнить случайными положительными трёхзначными числами. Показать количество нечетных\четных чисел
// 37. В одномерном массиве из 123 чисел найти количество элементов из отрезка [10,99]
// 38. Найти сумму чисел одномерного массива стоящих на нечетной позиции
// 39. Найти произведение пар чисел в одномерном массиве. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
// 40. В Указанном массиве вещественных чисел найдите разницу между максимальным и минимальным элементом
